{
  "projects": [
    {
      "id": 1,
      "title": "Barro Neles",
      "description": "Site destinado a uma campanha política para vereador de uma cidade no interior da Bahia. O site foi desenvolvido com React e SCSS. O site é responsivo e interativo, com um design moderno e atraente. O site possui uma área de denúncias, uma área de propostas e uma página de contato direto com o candidato.",
      "url": "https://www.barroneles.com/",
      "isFavorite": true,
      "technologies": ["React", "SCSS"]
    },
    {
      "id": 2,
      "title": "ChatterBox",
      "description": "ChatterBox é um aplicativo de chat em tempo real desenvolvido com WebSockets utilizando FastAPI. Ele permite que os usuários se comuniquem de forma instantânea e eficiente, proporcionando uma experiência de chat simples e interativa. O aplicativo é responsivo e possui um design moderno e atraente.",
      "url": "https://github.com/dacmarcell/chatterbox",
      "isFavorite": false,
      "technologies": ["FastAPI", "WebSockets"]
    },
    {
      "id": 3,
      "title": "CryptoGuardian",
      "description": "API desenvolvida com o intuito de facilitar transações com moedas físicas para moedas digitais, especificamente Ethereum. Basta passar o valor mínimo e máximo que você tem disponível para fazer a transação e a API vai validar a transação como true (possível de ser feita) e false (impossível de ser feita). É uma API de validação. O projeto foi desenvolvido com Node.js.",
      "url": "https://github.com/dacmarcell/cryptoguardian",
      "isFavorite": false,
      "technologies": ["Node.js"]
    },
    {
      "id": 4,
      "title": "GameRave",
      "description": "GameRave é uma API construída para que os usuários podem criar jogos e fornecer críticas sobre eles. Além disso, apresenta um sistema de likes e dislikes. Perfeito para você desenvolver sua interface frontend com esta API completamente gratuita. O projeto foi desenvolvido com Node.js, TypeORM, PostgreSQL e Docker.",
      "url": "https://github.com/dacmarcell/gamerave",
      "isFavorite": false,
      "technologies": ["Node.js", "TypeORM", "PostgreSQL", "Docker"]
    },
    {
      "id": 5,
      "title": "IdeaPlanAI",
      "description": "Um analisador de projetos que utiliza IA para calcular os requisitos funcionais, não funcionais, estimativa de tempo, tecnologias recomendadas e desafios em potencial a partir do projeto proposto. O projeto foi desenvolvido com Node.js, Typescript, Docker e uma versão standalone do modelo nemotron da LLM llama3 para gerar as respostas.",
      "url": "https://github.com/dacmarcell/IdeaPlanAI",
      "isFavorite": false,
      "technologies": ["Node.js", "Typescript", "Docker"]
    },
    {
      "id": 6,
      "title": "DevStackAPI",
      "description": "Uma API para gerenciar dados de perfis de portfólios de desenvolvedores de software. Permite customizar individualmente por perfil. O projeto foi desenvolvido com C#, ASP.NET CORE 8, Entity Framework, SQL Server e Docker.",
      "url": "https://github.com/dacmarcell/DevStackAPI",
      "isFavorite": true,
      "technologies": [
        "C#",
        "ASP.NET CORE 8",
        "Entity Framework",
        "SQL Server",
        "Docker"
      ]
    },
    {
      "id": 7,
      "title": "carbonFootprintCalculator",
      "description": "Uma API que calcula emissões de carbono baseada em consumo, dieta e meio de transporte do usuário",
      "url": "https://github.com/dacmarcell/carbonFootprintCalculator",
      "isFavorite": true,
      "technologies": ["PHP", "Laravel", "PostgreSQL"]
    }
  ]
}
